ahmedbody/a01_baseFile/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    timeStep;

writeInterval   250;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{

    #include "fieldMeans"

    #include "wallShearStress"

//    #include "skinFrictionCo"

    #include "yplus"

    #include "forceCoeffs"

    #include "probes"

    #include "boundaryprobes"

    #include "vorticity"

    #includeFunc "stressComponents"

    #includeFunc "pressureCoefficient"

    #includeFunc "sample"

    #includeFunc "sampleCp"

    #includeFunc "writeCellCentres"

  //  #include "gradients"

}


// ************************************************************************* //
