ahmedbody/a01_baseFile/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    ahmed_front
	{
        type            noSlip;

	}

	ahmed_sides
	{
        type            noSlip;

	}

	ahmed_top
	{
        type            noSlip;

	}

	ahmed_bottom
	{
        type            noSlip;

	}

	ahmed_slant
	{
        type            noSlip;

	}

	ahmed_rear
	{
        type            noSlip;

	}

	inlet
	{
        type            fixedValue;
        value           $internalField;
	}

	side_right
	{
        type            slip;
	}

	side_left
	{
        type            slip;
	}

	outlet
	{
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
	}

	top
	{
        type            slip;
	}

	bottom
	{
        type            fixedValue;
        value           $internalField;
	}

}


// ************************************************************************* //
