ahmedbody/a01_baseFile/0.orig/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

aRef = 346.16; //speed of sound
lRef = 1;
Ti = 0.01; //turbulent intensity at the inlet
mRef = 0.128; //reference velocity

flowVelocity (44.31 0 0);
pressure             0;
turbulentKE 0.29;
turbulentOmega 1.27;
turbulentEpisilon 0.38;
// ************************************************************************* //
