ahmedbody/a01_baseFile/system/fieldMeans
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

#include "functions/functionInputs"


fieldAverage1
{
    type            fieldAverage;
    libs            (fieldFunctionObjects);

    fields
    (
        U
        {
            mean        yes;
            prime2Mean  no;
            base        time;
            window      $avgWind;
            windowType  exact;
            allowRestart false;
        }

        p
        {
            mean        yes;
            prime2Mean  no;
            base        time;
            window      $avgWind;
            windowType  approximate;
            allowRestart  false;
        }

        omega
        {
            mean        yes;
            prime2Mean  no;
            base        time;
            window      $avgWind;
            windowType  approximate;
            allowRestart  false;
        }
    );


    writePrecision  $writePrec;
    writeToFile     $writeToFile;
    useUserTime     $useUserTime;
    log             $logged;
    timeStart       $tStart;
    timeEnd         $tEnd;
    executeControl  $executeCon;
    executeInterval $executeInt;
    writeControl    $writeCon;
    writeInterval   $writeInt;
}
