ahmedbody/a01_baseFile/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    f_slip;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (-130 -1.0001 0.99999)(-110 0 1.00001); // (MINX MINY MINZ) (MAXX MAXY MAXZ)
    }

    {
        name    f_slip;
        type    faceSet;
        action  subset;
        source  boundaryToFace;
        sourceInfo
        {
          name floor;
        }

    }

    //this didn't seem to work for some reason. the goal was to remove any
    //faces that were in front/back
    /*{
        name    f_slip;
        type    faceSet;
        action  delete;
        source  boundaryToFace;
        sourceInfo
        {
          name front,back;
        }
    }*/
);


// ************************************************************************* //
